rottenpotatoes/app/controllers/movies_controller.rb

  def match
    @movie= Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]